tests/Message/PaymentIntents/Mock/PurchaseSuccess.txt

HTTP/1.1 200 OK
Server: nginx
Date: Fri, 15 Feb 2013 18:25:28 GMT
Content-Type: application/json;charset=utf-8
Content-Length: 995
Connection: keep-alive
Cache-Control: no-cache, no-store
Request-Id: req_8PDHeZazN2LwML
Access-Control-Allow-Credentials: true
Access-Control-Max-Age: 300

{
  "id": "pi_1EW0FmFSbr6xR4YAvECSRCv2",
  "object": "payment_intent",
  "amount": 8000,
  "amount_capturable": 0,
  "amount_received": 8000,
  "application": null,
  "application_fee_amount": null,
  "canceled_at": null,
  "cancellation_reason": null,
  "capture_method": "automatic",
  "client_secret": "pi_1EW0FmFSbr6xR4YAvECSRCv2_secret_kUQ34vTWkFRAECbpbswOpAuus",
  "confirmation_method": "automatic",
  "created": 1556885558,
  "currency": "usd",
  "customer": "cus_F0026biLhRIcO9",
  "description": "Order #34",
  "invoice": null,
  "last_payment_error": null,
  "latest_charge": "ch_1EW0FmFSbr6xR4YAZyURWxQe",
  "livemode": false,
  "metadata": {
    "order_id": "34",
    "order_number": "aaefd8ec96095c47ed0c665666c3c768",
    "transaction_reference": "84aaac664c7048000146d3a88b5f0081",
    "client_ip": "::1"
  },
  "next_action": null,
  "on_behalf_of": null,
  "payment_method": "pm_1EW0FPFSbr6xR4YAZOSMHIOE",
  "payment_method_types": [
    "card"
  ],
  "receipt_email": null,
  "review": null,
  "shipping": null,
  "source": null,
  "statement_descriptor": null,
  "status": "succeeded",
  "transfer_data": null,
  "transfer_group": null
}